Revit 2027 API
ParameterTypeId.RbsGbxmlSurfaceType Property
 "Surface Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsGbxmlSurfaceType { get; }
Public Shared ReadOnly Property RbsGbxmlSurfaceType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsGbxmlSurfaceType {
	ForgeTypeId^ get ();
}
static member RbsGbxmlSurfaceType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace